RIET/src/Enums/TypesOfTemporaryImpExpTransaction/TypesOfTemporaryImpExpTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTemporaryImpExpTransaction</name>
  <enumValues>
    <name>TemporaryImport</name>
  </enumValues>
  <enumValues>
    <name>TemporaryExport</name>
  </enumValues>
  <enumValues>
    <name>Prolongation</name>
  </enumValues>
  <enumValues>
    <name>ResponsibleChange</name>
  </enumValues>
  <enumValues>
    <name>Reexport</name>
  </enumValues>
  <enumValues>
    <name>Reimport</name>
  </enumValues>
  <enumValues>
    <name>PermanentImport</name>
  </enumValues>
  <enumValues>
    <name>PermanentExport</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ИмпортЭкспорт/ИмпортЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИмпортЭкспорт</name>
  <enumValues>
    <name>Import</name>
  </enumValues>
  <enumValues>
    <name>Export</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/TypesOfTemporaryImpExpTransaction/ManagerModule.bsl
Функция ПолучитьImportExport(TypeOfTemporaryImpExpTransaction) Экспорт
	
	TypesOfTemporaryImpExpTransaction = Перечисления.TypesOfTemporaryImpExpTransaction;
	
	Если TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.TemporaryImport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reexport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentImport Тогда
		
		Возврат Перечисления.ИмпортЭкспорт.Import;
		
	ИначеЕсли TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.TemporaryExport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reimport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentExport Тогда
		
		Возврат Перечисления.ИмпортЭкспорт.Export;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ЭтоРучноеПринятие(TypeOfTemporaryImpExpTransaction) Экспорт
	
	TypesOfTemporaryImpExpTransaction = Перечисления.TypesOfTemporaryImpExpTransaction;
	
	Возврат TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.TemporaryImport
			ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.TemporaryExport;
	
КонецФункции
		
Функция ЭтоВывод(TypeOfTemporaryImpExpTransaction) Экспорт
	
	TypesOfTemporaryImpExpTransaction = Перечисления.TypesOfTemporaryImpExpTransaction;
	
	Возврат TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reexport
			ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reimport
			ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentImport
			ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentExport;
	
КонецФункции
		
Функция ПолучитьImportExportForItem(TypeOfTemporaryImpExpTransaction) Экспорт
	
	TypesOfTemporaryImpExpTransaction = Перечисления.TypesOfTemporaryImpExpTransaction;
	
	Если TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reexport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentImport Тогда
		
		Возврат Перечисления.ИмпортЭкспорт.Import;
		
	ИначеЕсли TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.Reimport
		ИЛИ TypeOfTemporaryImpExpTransaction = TypesOfTemporaryImpExpTransaction.PermanentExport Тогда
		
		Возврат Перечисления.ИмпортЭкспорт.Export;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
